import React, {useState, useEffect} from 'react'
import {componentToPDFBuffer} from '../../../../../components/pdf'
import axios from "axios"
import Config from "../../../../../config.json";

export default function () {
    return <></>
}

const Page = (worker) => {
    let styleRow = {
        overflow: 'hidden'
    }
    let style1 = {
        width: '50%',
        float: 'left'
    }
    let style2 = {
        width: '50%',
        float: 'right'
    }

    let date = new Date()
    let dateText = `${date.getDate()}-${date.getMonth()+1}-${date.getFullYear()}`

    return <>
        <div style={styleRow}>
            <div style={style1}>
                {Left()}
            </div>
            <div style={style2}>
                {Right()}
            </div>
        </div>
    </>
}

const Left = () => {
  return <>
      Осмотр гинеколога
      Менструация с ______ лет, регулярные / нерегулярные
      П/М ______________________________________________________________
      Б- _____, Р- _____, А- ______, В- ______
      Оперативные вмешательства __________________________________________
      НПО _______________________________________________________________
      Шейка матки ________________________________________________________
      Тело матки _________________________________________________________
      Придатки ___________________________________________________________
      Молочные железы ___________________________________________________
      Заключение _________________________________________________________
      ____________________________________________________________________
      Осмотр стоматолога
      _______________________________________________________________
      Осмотр психиатра/нарколога
      _______________________________________________________________
      ________________________________________________________________
      _______________________________________________________________

      ЗАКЛЮЧЕНИЕ
      Диагноз: ______________________________________________________
      ______________________________________________________________
      ______________________________________________________________
      Абсолютный ССР:  низкий,  умеренный,  высокий,  очень высокий
      Относительный ССР:  низкий,  умеренный,  высокий,  очень высокий
      Группа здоровья: 	1	2	3а	3б
      Противопоказания к работе: 	не выявлены		выявлены
      ______________________________________________________________
      РЕКОМЕНДАЦИИ: ___________________________________________
      ______________________________________________________________

      Председатель ВК _______________________________________________



      Осмотр терапевта
      Анамнез ________________________________________________________
      _______________________________________________________________
      Кожные покровы ________________________________________________
      Легкие: дыхание _________________________________________________
      Сердце: АД ______________________ PS ____________________________
      Тоны __________________________________________________________
      Живот _________________________________________________________
      Печень ________________________________________________________
      Физиологические отправления _____________________________________
      Заключение: ____________________________________________________
      _______________________________________________________________
      Осмотр невропатолога
      Анамнез _______________________________________________________
      _______________________________________________________________
      Менингеальные явления __________________________________________
      Ч/м нервы ______________________________________________________
      Сухожильные рефлексы __________________________________________
      Чувствительность _______________________________________________
      Координация ___________________________________________________
      Расстройства движений ___________________________________________
      Вегетативная н. с. _______________________________________________
      Периферическая н. с. ____________________________________________
      _______________________________________________________________
      Заключение: ____________________________________________________
      _______________________________________________________________
      _______________________________________________________________
      Осмотр офтальмолога
      Анамнез _______________________________________________________
      Визометрия: OD ____OS ______с коррекцией: OD ______OS ____________
      Офтальмоскопия ________________________________________________
      Биомикроскопия глаза ___________________________________________
      Рефрактометрия ________________________________________________
      Цветоощущение ________________________________________________
      Периметрия ____________________________________________________
      Заключение: ____________________________________________________
      ________________________________________________________________

  </>
}

const Right = () => {
    return <>
        Дата выдачи результата			Номер телефона
        _______________
        ФЛГ №
        дата:									ЭКГ




        ООО «ПУЛЬСАР»

        КАРТА
        предварительного \ периодического медицинского осмотра

        Фамилия ______________________________________________________
        Имя __________________________________________________________
        Отчество ______________________________________________________
        Дата рождения _________________________________________________
        Место работы__________________________________________________
        Структурное подразделение _____________________________________
        Должность ____________________________________________________
        Вредные производственные факторы: _____________________________
        ______________________________________________________________
        ______________________________________________________________
        ______________________________________________________________



        Осмотр отоларинголога
        Анамнез ____________________________________________________________
        ___________________________________________________________________
        Отоскопия _________________________ш. речь: прав. _________ лев. _______
        Риноскопия _____________________________________________________
        Ларингоскопия __________________________________________________
        Фарингоскопия __________________________________________________
        Вестибулярный аппарат __________________________________________
        Заключение _____________________________________________________
        ________________________________________________________________
        _________________________________________________________________
        Осмотр хирурга
        Анамнез _______________________________________________________
        _______________________________________________________________
        Кожные покровы ________________________________________________
        Лимфоузлы ______________________________________________________
        Щитовидная железа ______________________________________________
        Опорно-двиг. аппарат _____________________________________________
        Периферич. сосуды ______________________________________________
        Живот _________________________________________________________
        Заключение _____________________________________________________
        ________________________________________________________________
        _________________________________________________________________
        Осмотр дерматовенеролога
        Анамнез _______________________________________________________
        Видимые слизистые (розовые, гиперемированы, чистые, изменены)
        Волосистая часть головы: кожа (сухая, чистая, нормальная, измененная)
        ________________________________________________________________
        Лимфатические узлы _____________________________________________
        Кожные покровы: цвет _________________, эластичные, чистые, изменены
        Лицо___________________________________________________________
        Туловище ______________________________________________________
        Верхние конечности _____________________________________________
        Нижние конечности ______________________________________________
        Ногти _________________________________________________________
        Заключение _____________________________________________________
        ________________________________________________________________

    </>
}


const GetById = async (id) => {
    const url = `${Config.server.url}/api/worker/getById`
    let fields = {
        params: {
            ids: id,
        }
    }
    let result = await axios.get(url, fields)
    return result.data.response
}

export async function getServerSideProps ({query, req, res}) {

    let worker = await GetById(query.id)
    let buffer = await componentToPDFBuffer({
        component: Page(worker.items[0]),
        orientation: 'landscape'

    })

    // with this header, your browser will prompt you to download the file
    // without this header, your browse will open the pdf directly
    //res.setHeader('Content-disposition', 'attachment; filename="article.pdf');
    res.setHeader('Content-disposition', 'inline ; filename="article.pdf');

    // set content type
    res.setHeader('Content-Type', 'application/pdf');

    // output the pdf buffer. once res.end is triggered, it won't trigger the render method
    res.end(buffer);

    return {
        props: {
            worker: worker
        }
    }
}