import React, {useState, useEffect} from 'react'
import {componentToPDFBuffer} from '../../../../../components/pdf'
import axios from "axios"
import Config from "../../../../../config.json";

export default function () {
    return <></>
}

const Page = (worker) => {
    let styleRow = {
        overflow: 'hidden'
    }
    let style1 = {
        width: '50%',
        float: 'left'
    }
    let style2 = {
        width: '50%',
        float: 'right'
    }



    let date = new Date()
    let dateText = `${date.getDate()}-${date.getMonth()+1}-${date.getFullYear()}`

    return <>
        <div style={styleRow}>
            <div style={style1}>
                {Left()}
            </div>
            <div style={style2}>
                {Right()}
            </div>
        </div>
    </>
}

const Left = () => {
    let stylePunkt1 = {
        paddingBottom: '1px',
        fontWeight: 'bold',
        margin: 0,
        fontSize: '18px',
        width: '100%'
    }
    let stylePunkt2 = {
        paddingBottom: '1px',
        fontWeight: 'bold',
        margin: 0,
        fontSize: '18px',
        width: '100%'
    }
    let styleText = {
        paddingBottom: '1px',
        margin: 0,
        fontSize: '16px',
        width: '100%'
    }

  return <>
      <p style={stylePunkt2}>Осмотр гинеколога</p>
      <p style={styleText}>Менструация с ______ лет, регулярные / нерегулярные</p>
      <p style={styleText}>П/М __________________________________________________________</p>
      <p style={styleText}>Б- _____, Р- _____, А- ______, В- ______</p>
      <p style={styleText}>Оперативные вмешательства ____________________________________</p>
      <p style={styleText}>НПО _________________________________________________________</p>
      <p style={styleText}>Шейка матки ____________________________________________________</p>
      <p style={styleText}>Тело матки _____________________________________________________</p>
      <p style={styleText}>Придатки _______________________________________________________</p>
      <p style={styleText}>Молочные железы ________________________________________________</p>
      <p style={styleText}>Заключение _____________________________________________________</p>
      <p style={styleText}>________________________________________________________________</p>

      <p style={stylePunkt2}>Осмотр стоматолога</p>
      <p style={stylePunkt2}>____________________________________________________</p>

      <p style={stylePunkt2}>Осмотр психиатра/нарколога</p>
      <p style={stylePunkt2}>____________________________________________________</p>
      <p style={stylePunkt2}>____________________________________________________</p>
      <p style={stylePunkt2}>____________________________________________________</p>

      <br/>
      <p style={stylePunkt1}>ЗАКЛЮЧЕНИЕ</p>
      <br/>
      <p style={styleText}>Диагноз: ______________________________________________________</p>
      <p style={styleText}>______________________________________________________________</p>
      <p style={styleText}>______________________________________________________________</p>
      <p style={styleText}>бсолютный ССР:  низкий,  умеренный,  высокий,  очень высокий</p>
      <p style={styleText}>Относительный ССР:  низкий,  умеренный,  высокий,  очень высокий</p>
      <p style={styleText}>Группа здоровья: 	1	2	3а	3б</p>
      <p style={styleText}>Противопоказания к работе: 	не выявлены		выявлены</p>
      <p style={styleText}>______________________________________________________________</p>

      <br/>
      <p style={stylePunkt1}>РЕКОМЕНДАЦИИ: _________________________________</p>
      <p style={stylePunkt1}>___________________________________________________</p>

      <br/>
      <br/>
      <p style={styleText}>Председатель ВК _______________________________________________</p>


      <br/>
      <br/>
      <br/>
      <br/>
      <br/>


      Осмотр терапевта
      Анамнез ________________________________________________________
      _______________________________________________________________
      Кожные покровы ________________________________________________
      Легкие: дыхание _________________________________________________
      Сердце: АД ______________________ PS ____________________________
      Тоны __________________________________________________________
      Живот _________________________________________________________
      Печень ________________________________________________________
      Физиологические отправления _____________________________________
      Заключение: ____________________________________________________
      _______________________________________________________________
      Осмотр невропатолога
      Анамнез _______________________________________________________
      _______________________________________________________________
      Менингеальные явления __________________________________________
      Ч/м нервы ______________________________________________________
      Сухожильные рефлексы __________________________________________
      Чувствительность _______________________________________________
      Координация ___________________________________________________
      Расстройства движений ___________________________________________
      Вегетативная н. с. _______________________________________________
      Периферическая н. с. ____________________________________________
      _______________________________________________________________
      Заключение: ____________________________________________________
      _______________________________________________________________
      _______________________________________________________________
      Осмотр офтальмолога
      Анамнез _______________________________________________________
      Визометрия: OD ____OS ______с коррекцией: OD ______OS ____________
      Офтальмоскопия ________________________________________________
      Биомикроскопия глаза ___________________________________________
      Рефрактометрия ________________________________________________
      Цветоощущение ________________________________________________
      Периметрия ____________________________________________________
      Заключение: ____________________________________________________
      ________________________________________________________________

  </>
}

const Right = () => {
    let styleHeader = {
        paddingBottom: '10px',
        fontWeight: 'bold',
        margin: 0,
        fontSize: '24px',
        width: '100%',
        fontWeight: 'bold',
    }
    let styleHeaderRight = {
        paddingBottom: '1px',
        fontWeight: 'bold',
        margin: 0,
        paddingLeft: '350px',
        fontSize: '23px',
        width: '100%',
        fontWeight: 'bold',
    }
    let styleH2 = {
        paddingBottom: '1px',
        fontWeight: 'bold',
        margin: 0,
        fontSize: '23px',
        textAlign: 'center',
        width: '100%',
        fontWeight: 'bold',
    }
    let styleH1 = {
        paddingBottom: '1px',
        fontWeight: 'bold',
        margin: 0,
        fontSize: '28px',
        textAlign: 'center',
        width: '100%',
        fontWeight: 'bold',
    }
    let styleText = {
        paddingBottom: '1px',
        margin: 0,
        fontSize: '16px',
        width: '100%'
    }
    return <>
        <p style={styleHeader}>Дата выдачи результата</p>
        <p style={styleHeaderRight}>Номер телефона</p>
        <p style={styleHeaderRight}>_______________</p>
        <p style={styleHeader}>ФЛГ №</p>
        <p style={styleHeader}>дата:</p>
        <p style={styleHeaderRight}>ЭКГ</p>

        <br/>
        <br/>
        <br/>
        <br/>
        <br/>

        <p style={styleH2}>ООО «ПУЛЬСАР»</p>
        <br/>
        <p style={styleH1}>КАРТА»</p>
        <br/>
        <br/>
        <p style={styleText}>предварительного \ периодического медицинского осмотра»</p>
        <br/>
        <p style={styleText}>Фамилия ______________________________________________________</p>
        <p style={styleText}>Имя __________________________________________________________</p>
        <p style={styleText}>Отчество ______________________________________________________</p>
        <p style={styleText}>Дата рождения _________________________________________________</p>
        <p style={styleText}>Место работы__________________________________________________</p>
        <p style={styleText}>Структурное подразделение _____________________________________</p>
        <p style={styleText}>Должность ____________________________________________________</p>
        <p style={styleText}>Вредные производственные факторы: _____________________________</p>
        <p style={styleText}>______________________________________________________________</p>
        <p style={styleText}>______________________________________________________________</p>
        <p style={styleText}>______________________________________________________________</p>



        <br/>
        <br/>
        <br/>
        <br/>
        <br/>




        ______________________________________________________________
        ______________________________________________________________



        Осмотр отоларинголога
        Анамнез ____________________________________________________________
        ___________________________________________________________________
        Отоскопия _________________________ш. речь: прав. _________ лев. _______
        Риноскопия _____________________________________________________
        Ларингоскопия __________________________________________________
        Фарингоскопия __________________________________________________
        Вестибулярный аппарат __________________________________________
        Заключение _____________________________________________________
        ________________________________________________________________
        _________________________________________________________________
        Осмотр хирурга
        Анамнез _______________________________________________________
        _______________________________________________________________
        Кожные покровы ________________________________________________
        Лимфоузлы ______________________________________________________
        Щитовидная железа ______________________________________________
        Опорно-двиг. аппарат _____________________________________________
        Периферич. сосуды ______________________________________________
        Живот _________________________________________________________
        Заключение _____________________________________________________
        ________________________________________________________________
        _________________________________________________________________
        Осмотр дерматовенеролога
        Анамнез _______________________________________________________
        Видимые слизистые (розовые, гиперемированы, чистые, изменены)
        Волосистая часть головы: кожа (сухая, чистая, нормальная, измененная)
        ________________________________________________________________
        Лимфатические узлы _____________________________________________
        Кожные покровы: цвет _________________, эластичные, чистые, изменены
        Лицо___________________________________________________________
        Туловище ______________________________________________________
        Верхние конечности _____________________________________________
        Нижние конечности ______________________________________________
        Ногти _________________________________________________________
        Заключение _____________________________________________________
        ________________________________________________________________

    </>
}


const GetById = async (id) => {
    const url = `${Config.server.url}/api/worker/getById`
    let fields = {
        params: {
            ids: id,
        }
    }
    let result = await axios.get(url, fields)
    return result.data.response
}

export async function getServerSideProps ({query, req, res}) {

    let worker = await GetById(query.id)
    let buffer = await componentToPDFBuffer({
        component: Page(worker.items[0]),
        orientation: 'landscape'

    })

    // with this header, your browser will prompt you to download the file
    // without this header, your browse will open the pdf directly
    //res.setHeader('Content-disposition', 'attachment; filename="article.pdf');
    res.setHeader('Content-disposition', 'inline ; filename="article.pdf');

    // set content type
    res.setHeader('Content-Type', 'application/pdf');

    // output the pdf buffer. once res.end is triggered, it won't trigger the render method
    res.end(buffer);

    return {
        props: {
            worker: worker
        }
    }
}